#include "Render.h"
#include "Bullet.h"
#include "Timer.h"
#include "Sound.h"
#include "Player.h"
#include "Monster.h"

#define LOADING_TIME 3
#define delta_time 0.01 //화면을 새로 그려주는 시간

/* 준혁이*/
void LoadingPage1() // 로딩화면을 뿌려주는 함수
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■□□□■□□□□□□□□□□□■□□□□□□□□□□□□□□□■□■□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■■□□■□■■□■□■□■□□■□□□□■■□□■■□□□■■■□□□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■□■□■■□□■■□■□■□□■□□□■□□■■□□■□■□□■□■□■■■□□■■□□□□□□", WHITE);
	print(0, 0, "□■□□■■■□□■■□■□■□□■□□□■□□■■□□■□■□□■□■□■□□■■□□■□□□□□", WHITE);
	print(0, 0, "□■□□□■□■■□□■□■□□□■■■■□■■□□■■■■□■■□□■□■□□■□■■■□■□■□", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■□□□□□", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■■□□□□□□", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
}
void LoadingPage2() // 로딩화면을 뿌려주는 함수
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "□■□□□■□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■■□□■□□□□□□□□□□□■□□□□□□□□□□□□□□□■□■□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■□■□■□■■□■□■□■□□■□□□□■■□□■■□□□■■■□□□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■□□■■■□□■■□■□■□□■□□□■□□■■□□■□■□□■□■□■■■□□■■□□□□□□", WHITE);
	print(0, 0, "□■□□□■■□□■■□■□■□□■□□□■□□■■□□■□■□□■□■□■□□■■□□■□□□□□", WHITE);
	print(0, 0, "□□□□□□□■■□□■□■□□□■■■■□■■□□■■■■□■■□□■□■□□■□■■■□■□■□", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■□□□□□", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■■□□□□□□", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
}

void LoadingPage3() // 로딩화면을 뿌려주는 함수
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■□□□■□■■□□□□□□□□□□□□■□□□□□□□□□□□□□□□■□■□□□□□□□□□□", WHITE);
	print(0, 0, "□■■□□■■□□■■□■□■□□■□□□□■■□□■■□□□■■■□□□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■□■□■■□□■■□■□■□□■□□□■□□■■□□■□■□□■□■□■■■□□■■□□□□□□", WHITE);
	print(0, 0, "□■□□■■□■■□■□■□■□□■□□□■□□■■□□■□■□□■□■□■□□■■□□■□□□□□", WHITE);
	print(0, 0, "□■□□□■□□□□□■□■□□□■■■■□■■□□■■■■□■■□□■□■□□■□■■■□■□■□", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■□□□□□", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■■□□□□□□", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
}
void LoadingPage4() // 로딩화면을 뿌려주는 함수
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■□□□■□□□□■□■□■□□■□□□□□□□□□□□□□□□■□■□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■■□□■□■■□■□■□■□□■□□□□■■□□■■□□□■■■□□□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■□■□■■□□■■□■□■□□■□□□■□□■■□□■□■□□■□■□■■■□□■■□□□□□□", WHITE);
	print(0, 0, "□■□□■■■□□■□■□■□□□■□□□■□□■■□□■□■□□■□■□■□□■■□□■□□□□□", WHITE);
	print(0, 0, "□■□□□■□■■□□□□□□□□■■■■□■■□□■■■■□■■□□■□■□□■□■■■□■□■□", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■□□□□□", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■■□□□□□□", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
}
void LoadingPage5() // 로딩화면을 뿌려주는 함수
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□■□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■□□□■□□□□□□□□□□□■□□□□□□□□□□□□□□□■□■□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■■□□■□■■□■□■□■□□■□□□□■■□□■■□□□■■■□□□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■□■□■■□□■■□■□■□□■□□□■□□■■□□■□■□□■□■□■■■□□■■□□□□□□", WHITE);
	print(0, 0, "□■□□■■■□□■■□■□■□□■■■■■□□■■□□■□■□□■□■□■□□■■□□■□□□□□", WHITE);
	print(0, 0, "□■□□□■□■■□□■□■□□□□□□□□■■□□■■■■□■■□□■□■□□■□■■■□■□■□", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■□□□□□", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■■□□□□□□", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
}
void LoadingPage6() // 로딩화면을 뿌려주는 함수
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■□□□■□□□□□□□□□□□■□□□□■■□□□□□□□□□■□■□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■■□□■□■■□■□■□■□□■□□□■□□■□■■□□□■■■□□□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■□■□■■□□■■□■□■□□■□□□■□□■■□□■□■□□■□■□■■■□□■■□□□□□□", WHITE);
	print(0, 0, "□■□□■■■□□■■□■□■□□■□□□□■■□■□□■□■□□■□■□■□□■■□□■□□□□□", WHITE);
	print(0, 0, "□■□□□■□■■□□■□■□□□■■■■□□□□□■■■■□■■□□■□■□□■□■■■□■□■□", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■□□□□□", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■■□□□□□□", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
}
void LoadingPage7() // 로딩화면을 뿌려주는 함수
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■□□□■□□□□□□□□□□□■□□□□□□□□■■□□□□□■□■□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■■□□■□■■□■□■□■□□■□□□□■■□■□□■□□■■■□□□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■□■□■■□□■■□■□■□□■□□□■□□■■□□■□■□□■□■□■■■□□■■□□□□□□", WHITE);
	print(0, 0, "□■□□■■■□□■■□■□■□□■□□□■□□■□■■■■■□□■□■□■□□■■□□■□□□□□", WHITE);
	print(0, 0, "□■□□□■□■■□□■□■□□□■■■■□■■□□□□□□□■■□□■□■□□■□■■■□■□■□", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■□□□□□", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■■□□□□□□", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
}
void LoadingPage8() // 로딩화면을 뿌려주는 함수
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■□□□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■□□□■□□□□□□□□□□□■□□□□□□□□□□□□□■■■□■□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■■□□■□■■□■□■□■□□■□□□□■■□□■■□□■□□■□□□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■□■□■■□□■■□■□■□□■□□□■□□■■□□■□■□□■□■□■■■□□■■□□□□□□", WHITE);
	print(0, 0, "□■□□■■■□□■■□■□■□□■□□□■□□■■□□■□□■■□□■□■□□■■□□■□□□□□", WHITE);
	print(0, 0, "□■□□□■□■■□□■□■□□□■■■■□■■□□■■■■□□□□□■□■□□■□■■■□■□■□", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■□□□□□", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■■□□□□□□", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
}
void LoadingPage9() // 로딩화면을 뿌려주는 함수
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■□□□■□□□□□□□□□□□■□□□□□□□□□□□□□□□■□□□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■■□□■□■■□■□■□■□□■□□□□■■□□■■□□□■■■□■□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■□■□■■□□■■□■□■□□■□□□■□□■■□□■□■□□■□■□■■■□□■■□□□□□□", WHITE);
	print(0, 0, "□■□□■■■□□■■□■□■□□■□□□■□□■■□□■□■□□■□■□■□□■■□□■□□□□□", WHITE);
	print(0, 0, "□■□□□■□■■□□■□■□□□■■■■□■■□□■■■■□■■□□□□■□□■□■■■□■□■□", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■□□□□□", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■■□□□□□□", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
}
void LoadingPage10() // 로딩화면을 뿌려주는 함수
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■□□□■□□□□□□□□□□□■□□□□□□□□□□□□□□□■□■□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■■□□■□■■□■□■□■□□■□□□□■■□□■■□□□■■■□□□■■■□□□□□□□□□□", WHITE);
	print(0, 0, "□■□■□■■□□■■□■□■□□■□□□■□□■■□□■□■□□■□■□■□□■□■■□□□□□□", WHITE);
	print(0, 0, "□■□□■■■□□■■□■□■□□■□□□■□□■■□□■□■□□■□■□■□□■■□□■□□□□□", WHITE);
	print(0, 0, "□■□□□■□■■□□■□■□□□■■■■□■■□□■■■■□■■□□■□□□□□□■■■□■□■□", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■□□□□□", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■■□□□□□□", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
}
void LoadingPage11() // 로딩화면을 뿌려주는 함수
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■□□□■□□□□□□□□□□□■□□□□□□□□□□□□□□□■□■□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■■□□■□■■□■□■□■□□■□□□□■■□□■■□□□■■■□□□□□□□□■■□□□□□□", WHITE);
	print(0, 0, "□■□■□■■□□■■□■□■□□■□□□■□□■■□□■□■□□■□■□■■■□■□□■□□□□□", WHITE);
	print(0, 0, "□■□□■■■□□■■□■□■□□■□□□■□□■■□□■□■□□■□■□■□□■□■■■□□□□□", WHITE);
	print(0, 0, "□■□□□■□■■□□■□■□□□■■■■□■■□□■■■■□■■□□■□■□□■□□□■□■□■□", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■■□□□□□□", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
}
void LoadingPage12() // 로딩화면을 뿌려주는 함수
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■□□□■□□□□□□□□□□□■□□□□□□□□□□□□□□□■□■□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■■□□■□■■□■□■□■□□■□□□□■■□□■■□□□■■■□□□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■□■□■■□□■■□■□■□□■□□□■□□■■□□■□■□□■□■□■■■□□■■□□□□□□", WHITE);
	print(0, 0, "□■□□■■■□□■■□■□■□□■□□□■□□■■□□■□■□□■□■□■□□■■□□■□■□□□", WHITE);
	print(0, 0, "□■□□□■□■■□□■□■□□□■■■■□■■□□■■■■□■■□□■□■□□■□■■■□□□■□", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■□□□□□", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■■□□□□□□", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
}
void LoadingPage13() // 로딩화면을 뿌려주는 함수
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■□□□■□□□□□□□□□□□■□□□□□□□□□□□□□□□■□■□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■■□□■□■■□■□■□■□□■□□□□■■□□■■□□□■■■□□□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■□■□■■□□■■□■□■□□■□□□■□□■■□□■□■□□■□■□■■■□□■■□□□□□□", WHITE);
	print(0, 0, "□■□□■■■□□■■□■□■□□■□□□■□□■■□□■□■□□■□■□■□□■■□□■□□□■□", WHITE);
	print(0, 0, "□■□□□■□■■□□■□■□□□■■■■□■■□□■■■■□■■□□■□■□□■□■■■□■□□□", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■□□□□□", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■■□□□□□□", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
}

void Loadingbar()
{
	static int cnt = 0;
	int i;
	print(0, 0, "|", WHITE);
	for (i = 1; i < cnt; i++)
		print(0, 0, "■", WHITE);
	print(0, 0, "|", WHITE);
	cnt++;

}

void GameOverPage() // 게임종료화면을 뿌려주는 함수
{
	print(0, 0, "1 2 3 4 5 6 7 8 9 1 1 2 3 4 5 6 7 8 9 1 1 2 3 4 5 6 7 8 9 1 1 2 3 4 5 6 7 8 9 1 1 2 3 4 5 6 7 8 9 1", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                ♥                                                  ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);

}
void GameOverPage1() // 게임종료화면을 뿌려주는 함수
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                              ＼  /                                                 ", WHITE);
	print(0, 0, "                                                ♡                                                  ", WHITE);
	print(0, 0, "                                               /  ＼                                                ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);

}
void GameOverPage2() // 게임종료화면을 뿌려주는 함수
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                            ＼     /                                                ", WHITE);
	print(0, 0, "                                              ＼  /                                                 ", WHITE);
	print(0, 0, "                                            --  · --                                               ", WHITE);
	print(0, 0, "                                               /  ＼                                                ", WHITE);
	print(0, 0, "                                              /     ＼                                              ", WHITE);

}
void GameOverPage3() // 게임종료화면을 뿌려주는 함수
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                            ＼     /                                                ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                            -       -                                               ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                             /     ＼                                               ", WHITE);

}
void GameOverPage(float playtime) // 게임종료화면을 뿌려주는 함수
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "□□■■■■□□□□□□□□□□□□□□□□□□■■■■□□□□□□□□□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■■□□□□□□□□□□□□□□□□□□□□■■□□■■□□□□□□□□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "□■□□□□□□■■□□□■□■□□■■□□□■□□□□■■□□□■□■■□■□■■□□□□□□□□", WHITE);
	print(0, 0, "□■□□□■■■□□■□■□■□■■■■■□□■□□□□■■■□■■■■■■■■□□□□□□□□□□", WHITE);
	print(0, 0, "□■■□□□■■□□■□■□■□■■□□□□□■■□□■■□■■■□■□□□■□□□□□□□□□□□", WHITE);
	print(0, 0, "□□■■■■□□■■■■■□■□■□■■■□□□■■■■□□□■□□□■■■■□□□□■□■□■□□", WHITE);
	print(0, 0, "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);


	// 게임오버화면이 허접합니다..예쁘게 꾸며주세요
	// playtime은 총 플레이시간을 초 단위로 받아온 것입니다. 화면에 총 플레이시간을 뿌려주세요
	print(0, 80, "                                                                                                    ", WHITE);
}
/* 준혁이*/

/// 메인에서 전체적인 흐름과 각각의 오브젝트의 상호작용을 처리해줍니다.
int main()
{
	float loading_startTime; // 로딩 화면의 시작시간.
	float ingame_startTime; // 인게임 화면의 시작시간.
	float playTime; // 총 플레이타임

	Render_Init(); // 렌더 초기화
	Bullet_Init(); // 총알 초기화
	Monster_Init(); // 몬스터 초기화
	Timer_Start();
	Sound_PlayIngameBGM();
	
	loading_startTime = Timer_Now(); // 로딩화면 시작
	
	while (Timer_Now() - loading_startTime  < LOADING_TIME) // LOADING_TIME초 동안 로딩화면을 띄워줍니다.
	{
		Render(70);
		LoadingPage1();
		Loadingbar();
		Render(70);
		LoadingPage2();
		Loadingbar();
		Render(70);
		LoadingPage3();
		Loadingbar();
		Render(70);
		LoadingPage4();
		Loadingbar();
		Render(70);
		LoadingPage5();
		Loadingbar();
		Render(70);
		LoadingPage6();
		Loadingbar();
		Render(70);
		LoadingPage7();
		Loadingbar();
		Render(70);
		LoadingPage8();
		Loadingbar();
		Render(70);
		LoadingPage9();
		Loadingbar();
		Render(70);
		LoadingPage10();
		Loadingbar();
		Render(70);
		LoadingPage11();
		Loadingbar();
		Render(70);
		LoadingPage12();
		Loadingbar();
		Render(70);
		LoadingPage13();
		Loadingbar();

	}
	
	ingame_startTime = Timer_Now();
	
	while (1)
	{
		Render(delta_time);
		if(!Player_Update()) // 플레이어 사망시 게임종료
			break;
		Bullet_Update();
		Monster_Update();
		CirclePatton_Update();
	}
	playTime = Timer_Now() - ingame_startTime;
	Render(500);
	GameOverPage1();
	Render(500);
	GameOverPage2();
	Render(500);
	GameOverPage3();
	while (1)
	{
		Render(1000);
		GameOverPage(playTime);
	}
		
	
}